IdeaRS.OpenModel.CrossSection.InputValueType
Input value type

IdeaRS.OpenModel.CrossSection.InputValueType.Calculate
Calculate by the code

IdeaRS.OpenModel.CrossSection.InputValueType.UserInput
User input